import { createArticle } from "../../mock/article"

export const getInfoDate = () => {
    return createArticle(markdown)
}
const markdown = `# 专业介绍

 **三亚学院信息与智能工程学院下设计算机科学与技术、软件工程、软件工程（区块链）、数据科学与大数据技术、智能科学与技术五个本科专业（含方向），具体如下。**

 ## 一、计算机科学与技术（专业代码080901）

### 专业介绍：

计算机科学与技术专业成立于2005年，为海南省应用型转型专业，是中国顶尖民办大学专业，在海南省工学一流专业中排名第1。专业以就业为导向，从工业互联网对高技能新兴专业人才培养的需求出发，紧跟时代发展、紧靠工程认证，强化专业技能、优化培养体系，以“网络信息安全”、“移动应用开发”作为培养方向，拥有网络工程实验室、移动应用开发实验室，筹建网络安全实验室，在吉利信息中心等企业良好的合作基础上，着力推进“产学研用”的一体化。

### 目标培养

本专业培养具有良好工程素质、人文素养、职业道德和社会责任感，具备扎实的数理基础、工程知识，领域专业知识，专业以“厚基础、高能力、强实践”为原则，培养能够胜任网络信息安全、移动应用开发等领域的岗位能力，同时培养具有较强的创新意识、工程实践能力，并具备良好的再学习能力，及适应企业、社会发展需要的全面高素质复合应用型专业技术人才。

### 主要课程

通识教育系列课程、工程导论、高级程序设计语言、人工智能、软件工程、面向对象程序设计、计算机网络、Linux系统应用、计算机组成原理、数据库原理及应用、操作系统、算法分析与设计、机器学习等专业课程、路由与交换技术、网络与信息安全应用、移动应用前端技术、数据采集技术等专业方向课程；创新创业教育实践、创新实践、专业实习、毕业论文(设计)等综合性实践课程。

> 学制与修业年限：学制4年，修业年限4-6年
> 授予学位：工学学士学位

### 专业特色

计算机科学与技术专业师资雄厚、科研明确，注重学生实践能力的提升，实现与理论的交叉循环教学，并采用“递进式技能”的培养模式，以“赛教融合”、“产教融合”、“校企融合”等多种方式培养学生在工业互联网的网络安全、移动应用开发等领域内具有突出的专业技术能力、领先的创新意识和扎实的工程实践能力。

### 就业去向

毕业生能够在党政机关、企事业单位、信息行业从事计算机科学与技术专业相关，计算机网络系统、信息安全领域进行管理和服务，在全行业从事移动智能产品、移动互联网应用开发、移动互联网系统集成与维护等，也可继续攻读本专业或相关专业的研究生或出国深造。

## 二、软件工程（专业代码080902）

### 培养目标

本专业培养践行社会主义核心价值观，具有人文科学素养、良好的职业道德和社会责任感；系统掌握软件工程理论、知识，技能和方法；掌握最新的软件开发技术和软件项目管理方法，熟练使用流行的软件开发平台与工具，同时拥有良好的软件开发实践能力和软件工程素养；具有终身学习能力、快速适应行业发展的复合应用型专业技术人才。

### 主要课程

工程导论、高级语言程序设计、数据结构、操作系统原理、数据库原理及应用、计算机网络、面向对象程序设计、Web前端开发、数据分析及可视化技术、软件测试技术等专业课；JavaWeb开发技术、软件工程、软件项目开发、虚拟现实开发等项目开发课程；创新创业教育实践、创新实践、专业实习、毕业论文(设计)等综合性实践环节。

> 学制与修业年限：学制4年，修业年限4-6年  
> 授予学位：工学学士学位

### 专业特色

突出“学生中心、产出导向、持续改进”的育人理念，与吉利集团等企业合作构建产学研用协同育人模式。根据真实企业开发流程，构建能力导向、内容动态更新的一体化课程体系，实现专业教育与素质教育一体化，理论课程与实践课程一体化，教、学、做一体化，课内教学与课外活动一体化，校企合作与职业能力培养一体化，通过“双师型”教师与软件企业工程师联合指导的工程实践训练，实现校企合作一体化人才培养，引领专业特色发展。

### 就业去向

本专业毕业生可在各类IT企业、政府、企事业单位信息化部门从事计算机软件系统的需求分析、系统设计、开发、测试及运营维护和信息系统项目管理等工作。能够在工业互联网、游戏、影视、房地产、医疗等行业从事虚拟现实产品设计和开发的工作，也可继续攻读本专业或相关专业的硕士学位或出国深造。

## 三、软件工程：区块链工程方向

### 专业方向介绍

软件工程专业区块链工程方向是三亚学院为适应经济发展、产业升级和技术进步需要，面向区块链产业对区块链技术人才的需求于2020开设，同年开始招生。本专业方向紧密结合区块链行业社会需求、海南数字经济区域经济发展需要和行业技术发展方向，依托三亚学院超级计算中心、容淳铭院士区块链工作站，培养社会急需的区块链行业人才。

### 培养目标

本专业方向培养德智体美全面和谐发展，富有社会责任感，掌握区块链技术基本理论和区块链项目开发方法，具有区块链系统设计与实现能力、区块链项目管理与实施能力。具备较强的团队协作、沟通表达和信息搜索分析的职业素质；在区块链项目系统设计开发、区块链项目管理、区块链系统服务等领域发挥作用的复合应用型专业技术人才。

### 主要课程

工程导论、高级语言程序设计、数据结构、Linux操作系统、数据库原理及应用、计算机网络、区块链开发语言、Web前端开发技术、密码学及应用、软件测试技术、分布式系统、信息安全及应用等专业课；JavaWeb开发技术、软件工程、区块链原理及技术、智能合约开发、区块链工程实践等项目开发课程；创新创业教育实践、创新实践、专业实习、毕业论文(设计)等综合性实践环节。

> 学制与修业年限：学制4年，修业年限4-6年
> 授予学位：工学学士学位

### 专业特色

以产业发展需求为导向，深化产教融合、实施企业深度参与协同育人。校企协同制订专业建设方案和人才培养方案，提供涵盖比特币，以太坊，Hyperledger场景的实践培训,从技术角度使学生掌握核心区块链平台应用开发，综合项目将为学生提供实际区块链开发方案的实践经验。将人格塑造、素质养成、获取知识、培养能力和终身学习贯穿专业人才培养全过程。

### 就业去向

本专业方向毕业生可以区块链软件工开发工程师、区块链测试工程师、区块链运维工程师的角色进人政府、银行、证券商等金融机构、各征信机构、物联网与供应链、工业互联网领域等企事业单位从事区块链开发、区块链测试、区块链运维、网站开发与管理、项目管理和系统分析等工作，也可以继续攻读本专业或相关专业的硕士学位或出国深造。

## 四、数据科学与大数据技术（专业代码080910T）

### 专业介绍

本专业是三亚学院为落实国家《促进大数据发展行动纲要》及学院“人工智能+大数据”学科特色重点布局而设立，2018年经过教育部批准后开始招生，培养方向为大数据分析和大数据可视化。拥有吉利集团、中科曙光等企业和高性能计算中心、大数据专业实验室等实习实训环境和雄厚的师资，现为海南省一流本科建设专业。

### 人才培养目标

培养具有人文科学素养、良好工程素质、职业道德和社会责任感，系统掌握信息科学、数据科学基础理论、知识，具备大数据采集、处理、分析及可视化、系统运维、应用开发的专业能力，能从事大数据分析、大数据可视化、大数据系统运维等相关岗位工作的复合应用型专业技术人才。

### 主要课程

高等数学、大学英语、Python语言程序设计、数据统计基础、数据采集及预处理、数据结构、数据库原理及应用、操作系统、计算机网络、Web前端技术、可视化原理及应用、数据工程、最优化原理及应用、数据挖掘及机器学习、Hadoop大数据技术、高性能计算、深度学习、推荐算法及应用、创新创业教育实践、专业实习、毕业论文(设计)。

> 学制与修业年限：学制4年，修业年限4-6年
> 授予学位：工学学士学位

### 专业特色

借助海南省全面建设“信息智能岛”的契机，依托海南省第一个高性能计算实验室和大数据实验室，与吉利集团、中科曙光等企业构建产学研用创新协同育人模式。围绕自贸港、智慧城市、智慧金融、智慧旅游、智慧物流、工业互联网等特色领域，积极营造“全景式教学”环境，让学生浸入工程化项目，不断提高人才培养质量。

### 就业去向

在政府、企事业单位、社会组织等部门，从事数据采集、数据挖掘、大数据可视化、大数据实施、大数据系统运维等技术工作，也可以考取软件工程、计算机科学与技术、应用统计学等专业的研究生或出国深造。

## 五、智能科学与技术（专业代码080907T）

### 专业介绍

三亚学院“智能科学与技术”专业2019年经过教育部审批通过，根据三亚学院“人工智能+大数据”学科特色重点布局而设立。本专业以三亚学院高性能计算中心（超算中心）为平台，以工业互联网为核心，立足信息技术，融合数据智能，聚焦知识处理，培养掌握新一代人工智能技术的复合应用型专业技术人才。

### 人才培养目标

本专业培养具有良好的工程素质、人文素养、职业道德和社会责任感，有较强的创新意识、工程实践能力，并具备良好的学习能力。掌握计算机、大数据、软件、物联网等多学科交叉知识，成为在旅游管理、生命科学、医疗保健、政府治理、教学教育和业务管理等技术领域从事与人工智能应用有关的技术骨干，为培养具有以数据为中心的思考能力的人工智能工程师做准备。

### 主要课程

工程导论、人工智能、Python语言、数据结构、计算机网络、数据库、机器学习、深度学习、图像理解与视觉计算、推荐算法、自然语言处理、知识图谱等专业课程。自然语言处理、计算机视觉等综合性设计。认知实习、程序设计实践、智能工程技术与实践、创新创业教育实践、专业实习、毕业论文(设计)等综合性实践环节。

> 学制与修业年限：学制4年，修业年限4-6年  
> 授予学位：工学学士学位

### 专业特色

本专业为新工科特色专业，对接国家对人工智能专业发展和人才培养战略，紧紧围绕数据智能、工业智能、城市智能等广阔应用需求，聚焦计算机视觉、自然语言处理两大热点专业方向，高度注重专业课程产教融合和专业实践技能提高，形成“政产学研用”协同发展的专业特色。

### 就业去向

能在政府机关、企事业单位以及教育部门等从事图像处理、视频分析、舆情分析、品牌保护、精准营销、个性化推荐、智慧城市治理等智能化信息处理工作，也可在科研院所、教育机构等从事智能科学研究与人工智能教学工作。亦可继续攻读相关专业的硕士学位与出国深造。
`